{
  "common": {
    "Sign In": "Sign In",
    "Sign Up": "Sign Up",
    "comming soon": "comming soon",
    "free register": "free register",
    "switch language": "switch language"
  },
  "default": {
    "10 people or less": "10 people or less",
    "101-200 people": "101-200 people",
    "101-500 people": "101-500 people",
    "11-50 people": "11-50 people",
    "20 people or less": "20 people or less",
    "21-100 people": "21-100 people",
    "501-1000 people": "501-1000 people",
    "51-100 people": "51-100 people",
    "7*24 hours expert online service": "7*24 hours expert online service",
    "API access manage": "API access manage",
    "API access manage desc": "the caller contract can be created/revoked, and the call volume of different callers can be audited and restricted; API policies such as service load protection, cross-domain access permission, ip black and white list can also be easily implemented",
    "API document design": "API document design",
    "API document design desc": "based on the concept of configuration as code, api design based on the openapi 3 specification can be directly carried out in the code warehouse; while the service is deployed through the cicd pipeline, the corresponding version of the api is released",
    "API full life cycle manage": "API full life cycle manage",
    "API full life cycle manage desc": "the built-in functions of the platform are seamlessly connected, allowing developers to complete one-stop interface design, interface testing, and interface release",
    "API full life cycle manage description": "provide a full range of API management capabilities, based on API to achieve better team collaboration, traffic management and capability opening",
    "API gateway": "API gateway",
    "API sharing market": "API sharing market",
    "API sharing market desc": "in the API market, API-based communication and collaboration can accelerate parallel development across r&d teams; it can also help open service capabilities to the outside world, promote internal enterprise innovation, and cooperation with external partners",
    "APM monitoring": "APM monitoring",
    "Apply for trial": "Apply for trial",
    "Cloud Management Platform": "Cloud Management Platform",
    "DevOps Platform": "DevOps Platform",
    "Documentation": "Documentation",
    "Enterprise Digital Platform (Dice)": "Enterprise Digital Platform (Dice)",
    "FastData Platform": "FastData Platform",
    "I have read and agree": "I have read and agree",
    "IT department size": "IT department size",
    "Loading...": "Loading...",
    "Marketplace": "Marketplace",
    "Microservice Platform": "Microservice Platform",
    "More than 1000 people": "More than 1000 people",
    "More than 200 people": "More than 200 people",
    "No matching results": "No matching results",
    "Oh oh, there is nothing here": "Oh oh, there is nothing here",
    "Pricing": "Pricing",
    "Product": "Product",
    "Statistics module collects fast data application code": "the statistics module collects the data of fast data application code submission and task construction, which can accurately reflect the activity trend of the application and help the management of R&D efficiency.",
    "Success Story": "Success Story",
    "Username/phone number/email": "Username/phone number/email",
    "Zhejiang ICP No. 13004315-6": "Zhejiang ICP No. 13004315-6",
    "Zhejiang Public Network Security No. 33010802003150": "Zhejiang Public Network Security No. 33010802003150",
    "a one-stop enterprise digital platform based": "a one-stop enterprise digital platform based on a multi-cloud architecture, providing enterprises with devops, microservice governance, multi-cloud management, and fast data management and other cloud vendor-unbound it services",
    "a one-stop enterprise digital platform with a multi-cloud architecture": "a one-stop enterprise digital platform with a multi-cloud architecture,provide enterprises with cloud-native services such as devops, microservice governance, multi-cloud management, and fast data management.",
    "a powerful platform": "a powerful platform and a rich market make the technology more robust and the application more focused",
    "about": "about",
    "about us": "about us",
    "account login": "account login",
    "active monitoring of key business": "active monitoring of key business",
    "active monitoring of key business desc": "initiate uninterrupted timing requests to important business addresses, determine the health of application services, and actively count performance and health information",
    "actual name": "actual name",
    "address": "address",
    "all": "all",
    "application instructions": "application instructions",
    "application performance manage": "application performance manage",
    "application performance manage desc": "application performance monitoring tools for distributed systems, tailored for cloud-native (Docker, Kubernetes, Mesos) microservices, covering the complete end-to-service link",
    "application topology automatic discovery": "application topology automatic discovery",
    "application topology automatic discovery desc": "automatically draw the global topology architecture diagram according to the microservice calling relationship, which can clearly understand the relationship and calling situation between the microservices",
    "apply to use": "apply to use",
    "as the scale of the enterprise expands": "As the scale of the enterprise expands, the complexity of IT systems is getting higher and higher. In the process of Internet transformation, Haier has incubated hundreds of multi-format small and micro applications. These applications are often used by different vendors with different technical architectures. Development and operation and maintenance, applications are discrete and separated, and the problems that arise are:",
    "automated CI/CD": "automated CI/CD",
    "automated CI/CD desc": "provides pipeline services for code scanning, construction, testing, and deployment, making continuous integration of applications easier",
    "automatic test": "automatic test",
    "automatic test desc": "support drag-and-drop graphical orchestration of test cases and test scenarios, and provide multi-capable assertion and mock capabilities",
    "automation": "automation",
    "back to homepage": "back to homepage",
    "back to login": "back to login",
    "based on kubernetes + cloud": "based on kubernetes + cloud architecture, inherently cloud-native, eco-friendly",
    "based on pipeline engine": "based on the pipeline engine, the continuous integration process can be customized; it supports any language construction, and the expansion market provides a build pack for popular development languages; provides version management functions, including build output versions, version history, version rollbacks, etc. ; provides functions such as code quality analysis, automated interface testing, automated unit testing, etc., can be flexibly controlled to trigger automatic testing by setting hooks; provides energy efficiency analysis such as code analysis and construction analysis.",
    "based on the Dice platform": "based on the Dice platform to create central applications, including user centers and business centers, to achieve unified registration, unified certification, unified identification, and unified management for billion-level members. The business center realizes the group's unified product center, point center, order center, and service center. Realize effective support for core business and users.",
    "based on the pipeline engine": "based on the pipeline engine, the continuous integration process can be flexibly customized; it supports the construction of any language, and the expansion market provides a build pack for popular development languages; it provides energy efficiency analysis such as code analysis and construction analysis.",
    "basic edition": "basic edition",
    "best Practices in the Cloud Era": "best Practices in the Cloud Era",
    "both storage and computing engines are highly fault-tolerant": "both storage and computing engines are highly fault-tolerant, failed computing tasks can be self-repaired, and data is backed up by default, which is not volatile; data operations have their own version management, with full life cycle management capabilities from design, development to operation and maintenance ; Dice's monitoring platform can monitor components and data tasks and provide real-time warnings.",
    "branch rule manage": "branch rule manage",
    "branch rule manage desc": "following the GitFlow specification, the platform precipitates the contractual relationship between the branch and the environment. at the same time, it supports user-defined branch rule configuration",
    "break through tradition and put forward higher requirements": "it is necessary to break through the limitations of the strong coupling of traditional it architecture to flexibly support the gradual docking and expansion of more than 10,000 offline stores. it requires stronger microservice scheduling management and higher requirements for operation and maintenance monitoring.",
    "built-in rich Action and Addon capabilities": "built-in rich Action and Addon capabilities",
    "built-in rich Action and Addon capabilities desc": "the platform has built-in rich assembly line service template capabilities, which can be used directly according to different development languages and other dimensions",
    "business email address": "business email address",
    "business innovation costs are high": "business innovation costs are high and the cycle is long: the lack of a sharable service center, the chimney system built for specific business problems, cannot be effectively opened up, and there is a large number of repeated constructions, resulting in high innovation costs for enterprises.",
    "call authentication": "call authentication",
    "cancel": "cancel",
    "carry out one-stop microservice": "carry out one-stop microservice life cycle management, provide a complete tenant and environment isolation mechanism; provide a unified management and control interface, aggregate information about components such as business gateways, service registration and discovery, configuration centers, distributed tracking, monitoring and alarms, and provide One-stop service governance.",
    "category": "category",
    "centralized architecture": "centralized architecture: The enterprise digital platform (Dice) is built on the IaaS layer and serves as the basic IT foundation for enterprises to build business systems. On top of Dice, companies can build the shared services required by the major business segments of the company, and build the business systems required by each business segment on this basis. All major business systems adopt unified technical calibers and consistent data specifications to achieve business collaboration, information exchange, and data sharing between systems. Take Zhongnan Land as an example, and build the 'Zhongnan Purchase Supply Chain Collaborative Cloud Platform' based on the Dice platform to improve the synergy between Zhongnan Land's various departments and between Zhongnan Land and its suppliers.",
    "certification description": "certification description",
    "chimney architecture": "chimney architecture: The IT architecture of traditional enterprises is often chimney, with systems completely separated from each other, and part of the data is referenced and synchronized through interfaces. Taking Zhongnan Land as an example, the cost system and the procurement system are the core systems of its business, and the two systems are built by different construction parties, and the starting point of the system construction and the data caliber are inconsistent, which makes the integration of the two systems difficult. This will not only cause difficulties in the collaboration of various business sectors of the enterprise, but also result in the closure of data between systems, which cannot be unified and precipitated, and it is difficult to form effective analysis guidance.",
    "cloud manage": "cloud manage",
    "cloud manage desc": "provide a unified control plane across different cloud vendors or self-built Kubernetes clusters, make resource management and control more convenient, make business applications more flexible, and avoid cloud vendors lock-in",
    "cloud native": "cloud native",
    "cluster management": "cluster management",
    "code hosting": "code hosting",
    "code repository": "code repository",
    "code repository desc": "based on the Git protocol, the platform defaults to an enterprise-level code warehouse, which is ready to use out of the box, no need to build or purchase",
    "code scanning and unit testing": "code scanning and unit testing",
    "code scanning and unit testing desc": "discover code defects, security vulnerabilities, code irregularities and other issues in time",
    "comming soon": "comming soon",
    "company address": "2nd Floor, Building 1, Feitian Park, Yunqi Town, Dingshan Road, Zhuantang Street, Xihu District, Hangzhou",
    "company name": "company name",
    "compatible with consistent deployment and hybrid deployment": "compatible with consistent deployment and hybrid deployment",
    "comprehensive build type": "comprehensive build type",
    "comprehensive build type desc": "the platform fully supports various development language frameworks such as Java, Go, Node, Python, etc., and supports the construction of software packages such as application Docker images, Jar packages, and mobile application installation packages",
    "configuration Center": "configuration Center",
    "configuration parameter": "configuration parameter",
    "confirm password": "confirm password",
    "consistent deployment": "consistent deployment helps enterprises to easily migrate systems between clouds; hybrid deployment, staggered peaks improve the resource utilization of enterprises.",
    "contact email": "email",
    "contact us": "contact us",
    "containerized deployment of all components": "the containerized deployment of all components makes deployment, operation and maintenance efficient; computing and storage are separated, and the same data can be flexibly switched between different computing engines for analysis; distributed storage and computing architecture can linearly increase nodes and flexibly expand platform capabilities .",
    "continuous integration": "continuous integration",
    "copy {attribute} success": "copy {attribute} success",
    "corporate business consulting": "corporate business consulting",
    "cover the whole life cycle": "cover the whole life cycle",
    "covered 100+ large and medium-sized head enterprises": "has covered 100+ large and medium-sized leading companies, covering retail, real estate, parks, finance, construction and other fields",
    "create an open platform": "create a unified open platform to realize interconnection and capability opening for the whole group.",
    "custom log analysis rules": "custom log analysis rules",
    "custom log analysis rules desc": "by adding cleaning rules to the log, the log file structure is realized to meet the flexible business log visualization and alarm requirements",
    "customizable visualization of the market and alarms": "customizable visualization of the market and alarms",
    "customizable visualization of the market and alarms desc": "provide flexible custom chart alarm configuration to meet the display and alarm requirements of various monitoring operation and maintenance scenarios such as business monitoring, risk warning, performance analysis, etc.",
    "data bank": "data bank",
    "data bank desc": "based on the management of the test data source, the platform can prepare test data in large quantities through sql through the configuration sheet, and the configuration sheet and interface test cases can be seamlessly connected through the graphical orchestration pipeline",
    "data interoperability": "data interoperability: unified data governance system",
    "data lacks unified governance": "data lacks unified governance: applications of different technical architectures cannot be integrated, forming a large number of data islands. Taking member data as an example, users in different channels include offline stores, Weibo, WeChat and other self-media, official website community groups, and Youjia APP , Various industrial APP, shopping malls, micro-shops and other channels interact with Haier. Information is distributed in various interactive portals, which cannot be integrated and applied uniformly. The internal management of the enterprise is complicated and the user experience is poor. ",
    "data mart": "data mart",
    "data mart table produced by the data mart management data model": "the data mart table produced by the data mart management data model can be quickly located by searching the data table, and you can also view the detailed field information and indicator information in the table.",
    "data model": "data model",
    "data model management business section": "the data model manages business sections, data domains, dimensions, and business processes, and visually displays the relationship between dimensions and business processes in the form of a star chart.",
    "data task": "data task",
    "data task is a module that supports": "data task is a module that supports data task creation, operation and maintenance in fast data application. Based on the integrated workflow engine and scheduling engine of the Dice platform, the data pipeline can be configured flexibly and quickly, and the operation is simple and efficient.",
    "data tasks are displayed in a visualized process": "data tasks are displayed in a visualized process to help enterprises conduct real-time business risk monitoring and warning.",
    "declarative orchestration of cloud services": "declarative orchestration of cloud services",
    "declarative orchestration of cloud services desc": "based on declarative configuration, it can flexibly orchestrate various middleware cloud services provided by cloud vendors, such as databases, message queues, and object storage. Improve operation and maintenance efficiency and accelerate business migration to the cloud",
    "description": "description",
    "details": "details",
    "diagnosis of abnormal and slow transactions": "diagnosis of abnormal and slow transactions",
    "diagnosis of abnormal and slow transactions desc": "comprehensive application performance monitoring, covering time-consuming web interface, time-consuming RPC call, slow database query, cache, etc., to easily track down system slow issues",
    "dice can feedback in real time": "dice reflects the operating status of the system from four levels of availability, functionality, performance and efficiency, and can locate system operating problems in real time and provide real-time feedback.",
    "dice can realize code warehouse, application construction, deployment management, application monitoring": "dice can support the entire process of devops r&d for code warehouse, application construction, deployment management, and application monitoring. at the same time, it supports environment isolation in the application development cycle. applications can be popped up with one click. blue-green release guarantees service online, which improves the efficiency of enterprise r&d and deployment. it makes it possible to deploy multiple iterations a week.",
    "dice deeply connects with Alibaba": "dice can provide strong support for the development of upper-layer business systems through deep integration with alibaba’s technical and commercial capabilities, such as middleware, dataphin, iot, security, etc., such as providing iot capabilities for upper-layer applications through dice, accelerating the construction of smart store scenarios and realization.",
    "dice supports application elastic scaling, automatic failure recovery, facing the impact of large traffic": "dice supports elastic scaling of applications and automatic failure recovery. in the face of the impact of large traffic, it can respond to the impact of peak traffic by rapidly increasing resources. after the traffic falls back, resources will be returned, which can be used on demand, reducing costs and increasing efficiency.",
    "digital asset operatio desc": "from the perspective of the enterprise, analyze the resource utilization and availability of all digital assets, as well as cloud vendor bills and other data. View hot and idle assets vertically, and compare project costs and resource budgets horizontally",
    "digital asset operation": "digital asset operation",
    "document": "document",
    "easy to use": "easy to use",
    "ecological compatibility": "ecological compatibility",
    "efficient collaboration among team members with different functions": "different functional members of the team collaborate efficiently, and the rich project member roles are built-in, allowing team managers to more intuitively manage target management, resource input costs, and member R&D statistics, allowing developers to more effectively and orderly manage daily R&D tasks and defects, and make products /Project manager planning product demand pool, iteration plan and iteration progress tracking become simpler and more effective.",
    "email": "email",
    "enter the platform": "enter the platform",
    "enterprise official website": "enterprise official website",
    "enterprise size": "enterprise size",
    "enterprise-level container cloud platform": "the enterprise-level container cloud platform provides comprehensive devops functions such as hybrid cloud pool management, project management, continuous integration, continuous delivery, and operation and maintenance monitoring. bring a one-stop experience of efficient management, agile development, continuous delivery, and continuous operation and maintenance for enterprises to meet the needs of enterprises for agile development and efficient resource management.",
    "erda cloud": "erda cloud",
    "expand the market": "expand the market",
    "expanding the market to support business innovation": "expansion market supports business innovation: Dice's expansion market has strong service and task expansion capabilities. Extended services include basic middleware and microservices. Enterprises can register continuous integration projects as microservices to extend them for use by other projects and achieve the goal of self-built business centers; task extensions are used for execution pipelines, which can be used by enterprises or on their own Expansion of research and development tasks to expand pipeline capabilities.",
    "expert service": "expert service",
    "extended service": "extended service",
    "external code repository": "external code repository",
    "external code repository desc": "support seamless docking of mainstream code repository in the industry",
    "fast data application follows Alibaba OneData concep": "the data model of the fast data application originally follows the Alibaba OneData concept, and can quickly find the dimensions, indicators and other elements in the data model.",
    "fast data governance": "fast data governance",
    "flexible and efficient": "flexible and efficient",
    "flexible scaling": "flexible scaling",
    "focus on your own business applications": "focus on your own business applications, and leave the tedious operation and maintenance work to the platform to complete",
    "for the corporate project side perspective": "from the perspective of enterprise projects, provide project meta-information management, member management, etc., to meet many demands of enterprise project management; provide task work orders, record feedback project progress, report project abnormal events, etc.; enterprises can set up notification groups, which are effective Aggregate notification messages to individuals, such as event alerts, abnormal code quality, etc.",
    "forgot password": "forgot password",
    "format": "format",
    "free trial": "free trial",
    "from the front-end": "from the front-end or from the browser to the first-level server, container and code, application performance analysis can be performed at each level; application monitoring can automatically collect application-related information and grasp application status in time; decentralized tracking provides end-to-end tracking capabilities, precise positioning of functions and performance issues ; Support real-time correction and full-stack root cause positioning to improve the efficiency of operation, maintenance and development.",
    "from the front-end APP or browser to the back-end server": "from the front-end APP or browser to the back-end server, container and code, application performance analysis can be performed at all levels; application monitoring can automatically collect application-related information and grasp application status in time; distributed tracking provides end-to-end tracking capabilities and precise positioning Functional and performance issues; support real-time alarms and full-stack root cause positioning to improve the efficiency of O&M development.",
    "full link diagnosis and tracking": "full link diagnosis and tracking",
    "full link diagnosis and tracking desc": "according to the information capture of each request point in the link of each call of the microservice, the full transparency of the call information of the entire link is realized, and the diagnosis and analysis of the application call link are developed efficiently and conveniently",
    "fully automated development process": "fully automated development process, no need for professional operation and maintenance engineers to support",
    "fully compatible": "it is fully compatible with mainstream open source products such as Spring Cloud, Dubbo, Istio, and Kubernetes, ensuring smooth migration of applications, and in-depth customization of mainstream functions to meet enterprise-level high-performance and high-reliability requirements.",
    "gain insight into the performance of the complete transaction process": "insight into the performance of the complete transaction process, from the front-end APP or browser to the back-end server, container and code, can analyze application performance at various levels, visually manage the availability and performance of the system, and support real-time alarms and full-stack root causes Positioning to improve the efficiency of operation, maintenance and development.",
    "get verification code": "get verification code",
    "git Repo data model is portable": "the data model based on Git Repo management has high portability, significantly reducing the development cycle and cost of data applications based on enterprise data warehouses, and also greatly reducing the operation and maintenance costs of data warehouses, data processing, and data applications.",
    "graphical orchestration": "graphical orchestration",
    "graphical orchestration desc": "provides a drag-and-drop graphical editing method to make CI/CD editing easier",
    "haier": "haier",
    "haier Group was founded": "haier Group was founded in 1984 and is a global brand of large home appliances. It has now transformed from a traditional manufacturer of home appliances to a platform for incubating makers for the whole society; Haier Smart Home uses the Internet of Things, artificial intelligence, and big data to open things through U+ Combine platform and scene business to achieve the best smart life experience. ",
    "haier relies on the best": "haier relies on the best practice of enterprise digital platform (Dice) to realize digital transformation",
    "header devOps desc": "Application-centric DevOps to create the ultimate enterprise-level application development experience",
    "header fdp desc": "fast data management based on streaming computing, providing a real-time unified data management platform",
    "header ms desc": "microservice governance without code intrusion to ensure the safety and stable production of enterprise applications",
    "header multi-cloud desc": "cloud vendors unbound multi-cloud management to build an efficient enterprise hybrid cloud architecture",
    "help Xinhua Bookstore build an industrial chain": "enterprise digital platform (Dice) helps Xinhua Bookstore build a network-wide digital cultural industry chain centered on online shopping malls",
    "help companies quickly analyze real-time data from different systems": "help companies quickly analyze real-time data from different systems, and guide companies to quickly make business decisions. The architecture of distributed storage and computing enables the platform to have high stability and scalability; the separation of computing and storage brings flexibility to the choice of computing engine; Dice-based one-stop management improves user ease of use.",
    "high portability": "high portability",
    "high scalability": "high scalability",
    "high stability": "high stability",
    "hybrid cloud management": "hybrid cloud management",
    "image verification code": "image verification code",
    "in recent years": "in recent years, real estate companies have actively responded to the call of the state to carry out corporate reforms and practice modern supply chains. The current system of the enterprise often becomes a barrier to the innovation and development of the enterprise's business and improving the efficiency of supplier collaboration, mainly due to the following points.",
    "infrastructure interoperability": "infrastructure interoperability: a unified infrastructure management system",
    "innovative business scenarios require a lot of external empowerment": "innovative business scenarios require a lot of external empowerment, such as iot capabilities, data processing capabilities, etc. it is difficult for companies with these capabilities to build their own from 0 to 1. how to make better use of industry capabilities to achieve rapid construction of its own business is a major challenge for enterprises digital transformation.",
    "intelligent operation and maintenance": "intelligent operation and maintenance",
    "interface documentation": "interface documentation",
    "introduction": "introduction",
    "it is fully compatible with mainstream open": "it is fully compatible with mainstream open source products such as Spring Cloud, Dubbo, Istio, Kubernetes, etc., to ensure smooth application migration, and supports in-depth customization of mainstream functions to meet enterprise-level high-performance and high-reliability requirements.",
    "join as a partner": "join as a partner",
    "join us": "join us",
    "keep logged in": "keep logged in",
    "large business volume": "the business volume is large, and it needs to be able to cope with the instantaneous peak flow of national activities and maintain the stable operation of the system. taking a star pre-sale event as an example, its peak flow can reach 100,000 +qps in an instant.",
    "library": "library",
    "links": "links:",
    "log analysis management": "log analysis management",
    "log analysis management desc": "log analysis is a service for searching and analyzing application logs, helping users to dig deeper into the business value of log data",
    "log data visualization and alerting": "log data visualization and alerting",
    "log data visualization and alerting desc": "for log analysis results, provide flexible custom chart alarm configuration to meet the display and alarm requirements of various monitoring operation and maintenance scenarios such as business monitoring, risk warning, performance analysis, etc",
    "log in immediately": "log in immediately",
    "mailbox": "mailbox",
    "make full use of the security": "make full use of the security architecture of the public cloud platform to strengthen and protect the platform in an all-round way",
    "market": "market",
    "microservice R&D": "microservice R&D",
    "microservice architecture supports intelligent operation and maintenance": "micro-service architecture supports intelligent operation and maintenance: The micro-service research and development of the enterprise digital platform (Dice) provides monitoring and alarm functions to help enterprises perform three-dimensional monitoring of the system, reflecting the system operation status from four levels of availability, functionality, performance and efficiency, and timely Tracking and locating system problems, to achieve a substantial increase in system stability.",
    "middleware platform": "middleware platform",
    "millisecond data processing": "millisecond data processing",
    "mobile application": "mobile application",
    "modern digital technology": "modern digital technology has become the core engine of enterprise transformation and innovation!",
    "more": "more",
    "multi-cloud architecture": "multi-cloud architecture",
    "multi-cloud management": "multi-cloud management",
    "nickname": "nickname",
    "no content yet": "no content yet",
    "no current request": "no current request",
    "no deployment, no operation and maintenance": "no deployment, no operation and maintenance",
    "node resources can easily": "node resources can easily be dynamically expanded and contracted, and various business promotion activities can be easily dealt with",
    "ok": "ok",
    "one-stop microservice lifecycle management": "it can carry out one-stop microservice life cycle management, provide a complete tenant and environment isolation mechanism; provide a unified management and control interface, aggregate information about components such as business gateways, service registration and discovery, configuration centers, distributed tracking, monitoring and alarms, Provide one-stop service governance.",
    "one-stop platform": "one-stop platform",
    "one-stop service governance": "one-stop service governance",
    "online marketing of Xinhua Bookstore": "Xinhua Bookstore Online Mall is positioned as the unified external portal of Xinhua Bookstore Group, aiming to empower tens of thousands of stores and publishing houses across the country, realize online and offline integration, resource sharing, form an integrated user experience, and upgrade 'Yue' Reading experience. This project is a comprehensive innovation and bold attempt by Xinhua Bookstore Group to face new Internet media. The group is positioned to focus on online shopping malls, and will gradually improve its membership management, smart stores, urban study rooms and other business segments. At the same time, it will cooperate with provincial and municipal stores and libraries. , Publishing houses, enterprises and institutions to achieve resource integration and global marketing.",
    "open market": "open the market, enterprises can freely choose the extended functions provided by third parties, or they can develop customized extended functions according to their needs.",
    "or use the mobile browser to enter the URL": "or use the mobile browser to enter the URL",
    "other": "other",
    "overview": "overview",
    "page loading": "page loading",
    "parameter name": "parameter name",
    "parameter value": "parameter value",
    "parsing, please wait...": "parsing, please wait...",
    "partners": "partners",
    "password": "password",
    "personal study": "personal study",
    "phone number": "phone number",
    "pipeline task": "pipeline task",
    "platform high availability": "platform high availability",
    "platform supports machine learning": "the platform supports the development and use of mainstream machine learning algorithms, and can perform complex data mining activities based on streaming data and historical data at the same time.",
    "please at {browser} open the current page in the browser": "please at {browser} open the current page in the browser",
    "please choose {size}": "please choose {size}",
    "please download on the mobile terminal": "please download on the mobile terminal",
    "please enter": "please enter",
    "please enter the correct email": "please enter the correct email",
    "please enter the correct phone number": "please enter the correct phone number",
    "please enter the password": "please enter the password",
    "please enter {realname}": "please enter {realname}",
    "please fill in your real information in order to pass the review as soon as possible and start the trial": "please fill in your real information in order to pass the review as soon as possible and start the trial",
    "please input your email": "please input your email",
    "please select the version to download": "please select the version to download",
    "please use HTTPS protocol link": "please use HTTPS protocol link",
    "pool management of resources": "pool management of resources, maximize the use of resources, and avoid resource waste; support dynamic expansion and contraction, use resources on demand, enterprises do not need to care about the management of a single machine; combined with refined operation and maintenance, the purpose of all resources is clear at a glance. The precise allocation of the cost is convenient for cost control and departmental accounting.",
    "poor system performance": "poor system performance: The use of traditional architecture leads to poor system stability and frequent system failures. The lack of a monitoring mechanism for the system makes it impossible for companies to locate problems in a timely manner, track problems and optimize the system.",
    "poor system scalability": "poor system scalability: Once there is a problem in the underlying technology, it will directly affect the business system. Enterprises need highly scalable systems to support the rapid iterative launch of new requirements and the realization of innovative services.",
    "pop up all microservices with one click": "dice.yml pops up all microservices with one click, ready to use; most scenarios of enterprise applications can be accessed in one stop without modification, which is convenient and fast; simple and easy-to-use microservice governance and non-intrusive visual APM performance management process , Which makes the management, operation and maintenance of microservices easier.",
    "position": "position",
    "position is ready": "position is ready",
    "powerful service": "powerful service and task expansion capabilities. Extended services include basic middleware and microservices. Enterprises can register continuous integration projects as microservices to extend them for use by other projects and achieve the goal of self-built business centers; task extensions are used for execution pipelines, which can be used by enterprises or on their own Expansion of research and development tasks to expand pipeline capabilities.",
    "product architecture": "product architecture",
    "product characteristic": "product characteristic",
    "product features": "product features",
    "professional edition": "professional edition",
    "project management": "project management",
    "provide a series of service governance strategies": "provide a series of service governance strategies to ensure the stable operation of services; highly available container clusters, complete failover strategies, visualized all-round monitoring, service current limiting and fuse, all together to escort the platform.",
    "provide cluster control interface": "provide cluster control interface, including operation and maintenance perspectives, analysis reports, machine management, service catalogs, etc., to escort the normal operation of enterprise services, so as to achieve efficient and refined operation and maintenance of the cluster.",
    "provide front-end and back-end standardized R&D framework": "provide front-end and back-end standardized research and development frameworks, help companies formulate engineering specifications, and easily use various microservices and capabilities, and also enable applications to focus more on business logic, which greatly improves development efficiency.",
    "provide high-performance git": "provide high-performance git code hosting services and easy-to-use visual editing services. It is highly integrated on the Dice platform and seamlessly connects to the CI/CD process. ",
    "provide one-stop microservice governance": "provide one-stop microservice governance, including service registration and discovery, configuration management, service gateway, monitoring and alarming and other functions, and is committed to helping enterprises quickly build high-scalability, low-cost, and high-performance distributed systems. Provide a standardized front-end and back-end R&D framework, help companies formulate engineering specifications, easily use various microservices and capabilities, and improve corporate R&D efficiency.",
    "provide one-stop service for log data": "provide one-stop service for log data",
    "provide one-stop service for log data desc": "provide log data collection, consumption, delivery, query analysis and other functions, perform structured tag retrieval of logs, and automatically associate logs and call links to realize log diagnosis and analysis of the entire link",
    "provide the required microservices for your application development": "provide the required microservices, middleware services, business plug-in capabilities, pipeline tasks, big data tasks and other capabilities for your application development",
    "provides a variety of high-availability middleware": "provides a variety of high-availability middleware (Mysql, zookeeper, redis, etc.), as well as the refined operation and maintenance capabilities of each middleware; provides an operation and maintenance background for each middleware, supporting configuration changes, capacity expansion, backup, etc. operating.",
    "purpose of application": "purpose of application",
    "real-time collection, storage and analysis of data from different data sources": "real-time collection, storage and analysis of data from different data sources can reduce latency to the millisecond level at the fastest; high-performance storage and computing components can be rapidly expanded as needed, allowing linear growth in computing and storage capabilities; simple users The interface and usage method promote the rapid implementation of the project.",
    "refined authority manage": "refined authority manage",
    "refined authority manage desc": "according to the different latitudes of the project, the user role of the application, the branch, etc., the access and editing permissions of the code branch are subdivided",
    "refined operation and maintenance": "refined operation and maintenance",
    "registered": "registered",
    "registry": "registry",
    "resource": "resource",
    "resource pooling": "resource pooling",
    "rich product features of the enterprise digital platform (Dice)": "The rich product features of the enterprise digital platform (Dice) provide enterprises with strong underlying technical support.",
    "rich release management": "rich release management",
    "rich release management desc": "support according to the needs of the release level, add the designated approver in the pipeline to approve and approve before deployment, or through the enterprise-level network closure to uniformly control the enterprise deployment approval management",
    "safety": "safety",
    "scan and follow WeChat Official Account": "scan and follow WeChat Official Account",
    "scan the QR code to download": "scan the QR code to download",
    "search by path or description": "search by path or description",
    "serious waste of basic resources": "serious waste of basic resources: Distributed deployment and operation and maintenance cannot maximize the allocation and scheduling of resources, resulting in low enterprise efficiency. At the same time, distributed operation and maintenance leads to uneven system operation and maintenance levels and many hidden dangers. ",
    "service governance": "service governance",
    "service interoperability": "service interoperability: unified software technology system",
    "service market": "service market",
    "share details": "share details",
    "sign out": "sign out",
    "smart and easy to use": "smart and easy to use",
    "sorry, there is a problem with the current request": "sorry, there is a problem with the current request, we will fix it as soon as possible!",
    "specification": "specification",
    "standard and convenient": "standard and convenient",
    "standardized R&D process framework": "standardized R&D process framework",
    "statistics": "statistics",
    "submit": "submit",
    "submitted successfully!": "submitted successfully!",
    "success stories": "success stories",
    "support cluster architecture at the same time": "at the same time, it supports cluster architectures such as Kubernetes and DC/OS. Enterprises can focus on business research and development without worrying about underlying issues and risks; shield cluster technology and support enterprises to seamlessly migrate the underlying architecture.",
    "support elastic expansion": "support elastic expansion, easily realize horizontal and initial expansion of business and dependent services. Facilitate rapid development and continuous innovation, and reduce development and operation and maintenance costs.",
    "support multi-cloud management and control, shield multi-cloud heterogeneity": "supports multi-cloud management and control, shields multi-cloud heterogeneity; provides a cluster control interface, including operation and maintenance perspectives, analysis reports, machine management, service catalogs, etc.; pool management of resources, on-demand use, to avoid waste; support for enterprise multi-tenancy In the form of a cluster, the cluster can be leased to other enterprises to ensure the isolation of resources between enterprises.",
    "supports multi-cloud management": "supports multi-cloud management and control, shields multi-cloud heterogeneity; provides a correct interference interface, including operation and maintenance perspectives, analysis reports, machine management, service catalogs, etc.; pool management of resources, on-demand use, to avoid waste; support for multiple enterprises The form of tenants is feasible and can be rented to other enterprises to use, and to ensure the isolation of resources between enterprises.",
    "telephone": "telephone",
    "test cases and bug manage": "test cases and bug manage",
    "test cases and bug manage desc": "support manual use cases, interface use cases, use case planning, test reports, and full testing process management of defects",
    "test manage": "test manage",
    "test manage desc": "provide a full range of test manage capabilities including code unit testing, code security testing, manual test case management and automatic testing",
    "thank you for your attention! We will contact you as soon as possible!": "thank you for your attention! We will contact you as soon as possible!",
    "the Dice platform implements a unified": "the Dice platform implements a unified technical architecture (microservices), unified scheduling of multi-cloud resources and unified data governance, and solves the problems of unified R&D, unified deployment, and operation and maintenance of enterprises in a multi-cloud environment.",
    "the built-in data model fully covers ETL": "the built-in data model completely covers the entire life cycle of ETL, modeling and governance, and drives the business to respond to data changes in real time.",
    "the configuration center can centrally manage applications": "the configuration center can centrally manage the configuration of different environments and different clusters of the application. After the configuration is modified, it can be pushed to the application side in real time, and it has features such as standardized permissions and process governance. Using the configuration center, you can greatly reduce the workload of configuration management in scenarios such as microservices and DevOps, and enhance the service capabilities of configuration management.",
    "the current request has no body": "the current request has no body",
    "the download link does not exist, please refresh later and try again": "the download link does not exist, please refresh later and try again",
    "the entire product is friendly and easy to use for developers": "the entire product is friendly and easy to use for developers: the enterprise digital platform has a visual interface, for example, provides a cluster control interface for enterprises, including operation and maintenance perspectives, analysis reports, machine management, service catalogs, etc., simple and easy to use; in addition A standardized R&D process framework is provided for technical personnel to reduce the pressure on the IT side of the enterprise, and basic developers can easily get started.",
    "the overall business of xinhua bookstore is built on the enterprise digital platform (dice)": "the overall business of xinhua bookstore is built on the enterprise digital platform (dice). dice provides good paas layer support for the development of upper-layer business, allowing the r&d team to focus on the business itself without worrying about paas layer issues and risks.",
    "the platform has complete functions": "the platform has complete functions, from development to operation and maintenance, from business to data to achieve comprehensive coverage",
    "the registry helps manage the microservice platform": "the registry helps you build, deliver, and manage a microservice platform more agile and easily. It is a service infrastructure for building a modern application architecture centered on 'services' (such as microservice paradigm, cloud native paradigm). Using the registry, you can discover, register, and manage microservices, and quickly implement dynamic service discovery, service registration, service metadata, and traffic management.",
    "the whole project needs to be iterated": "different from the relatively stable characteristics of traditional middle and back-end applications in enterprises, innovative businesses must deal with faster iterations. the xinhua bookstore project needs to deal with higher complexity and more frequent deployment pace due to its innovative diversity, and the entire project needs to be iteratively deployed multiple times a week.",
    "there is no installation package for this model at the moment": "there is no installation package for this model at the moment",
    "through the enterprise": "through the enterprise digital platform (Dice), we provide a container-based multi-cloud management system, a service research and development system with a microservice architecture as the core, and a data governance system based on fast data. The implementation of the interconnection platform is completed in three stages:",
    "through the enterprise digital platform": "practicing the smart supply chain of the real estate industry through the enterprise digital platform (Dice)",
    "to create an interconnection platform ": "to create an interconnection platform ",
    "to provide dynamic routing with API granularity for microservices": "API gateways can provide microservices with API-granular dynamic routing, ACL authentication, traffic restriction, security protection, real-time monitoring and other functions; it can also help companies manage the opening of internal system APIs to the outside world, reduce IT operation and maintenance costs, and improve system flexibility While ensuring safety and reliability.",
    "training and support": "training and support",
    "try the enterprise digital platform (Erda Cloud) now": "try the enterprise digital platform (Erda Cloud) now",
    "type of certification": "type of certification",
    "ultimate edition": "ultimate edition",
    "unable to build": "unable to build on their own: Traditional companies have not invested too much money in the construction of IT departments, which directly leads to weak IT capabilities and low levels of IT construction. When enterprises practice digital transformation, they will find that IT power cannot support the construction of enterprises from technical systems to business systems. What's more, the external builder of the original system of the enterprise does not provide the source code, and can only do the secondary development of the system, which poses a greater challenge to the enterprise IT power.",
    "unbind business applications": "unbind business applications from cloud vendors, easily realize business migration between multiple clouds, without worrying about being locked up by a single cloud vendor",
    "updated on": "updated on",
    "uphold the IaC philosophy": "adhering to the IaC concept, it provides one-stop DevOps experience such as code hosting, continuous integration, multiple environments, pipelines, and version management to improve R&D energy efficiency.",
    "user Agreement": "user Agreement",
    "verification code login": "verification code login",
    "version": "version",
    "version details": "version details",
    "view more cases": "view more cases",
    "visualized data tasks": "visualized data tasks",
    "we look forward to your joining": "we look forward to your joining",
    "weChat public account": "weChat public account",
    "what difficulties does your team have in the application development process?": "what difficulties does your team have in the application development process?",
    "white screen operation and maintenance Kubernetes": "white screen operation and maintenance Kubernetes",
    "white screen operation and maintenance Kubernetes desc": "on the web interface of multi-cloud management, all Kubernetes operation and maintenance operations can be completed without logging in to the machine. Based on TLS encryption, ACL control, and log auditing, all operation and maintenance operations are safe and traceable",
    "why choose erda cloud?": "why choose erda cloud?",
    "xinhua Bookstore has many stores": "Xinhua Bookstore is a state-owned book publishing company in China, with 12,000 offline stores.",
    "xinhua bookstore": "xinhua bookstore",
    "your network has been restored": "your network has been restored",
    "your network is disconnected": "your network is disconnected",
    "zhongnan Land": "zhongnan Land",
    "zhongnan Land is the flagship real estate brand of Zhongnan Construction Group": "zhongnan Land is the flagship real estate brand of Zhongnan Construction Group. With the support of the multi-industry chain integration and linkage of the parent group, it has achieved rapid development, Won the top 20 Chinese real estate development companies in 2018 and the top 10 commercial real estate operations of China real estate development companies in 2018."
  }
}
