{
  "common": {
    "comming soon": "comming soon",
    "free register": "free register",
    "log in": "log in",
    "switch language": "switch language"
  },
  "default": {
    "7*24 hours expert online service": "7*24 hours expert online service",
    "API full life cycle manage": "API full life cycle manage",
    "API full life cycle manage desc": "the built-in functions of the platform are seamlessly connected, allowing developers to complete one-stop interface design, interface testing, and interface release",
    "API gateway": "API gateway",
    "API manage": "API manage",
    "Ali Cloud": "Ali Cloud",
    "DataCenter": "DataCenter",
    "DevOps": "DevOps",
    "Enterprise Digital Platform (Dice)": "Enterprise Digital Platform (Dice)",
    "a one-stop enterprise digital platform based": "a one-stop enterprise digital platform based on a multi-cloud architecture, providing enterprises with devops, microservice governance, multi-cloud management, and fast data management and other cloud vendor-unbound it services",
    "a one-stop enterprise digital platform with a multi-cloud architecture": "a one-stop enterprise digital platform with a multi-cloud architecture,provide enterprises with cloud-native services such as devops, microservice governance, multi-cloud management, and fast data management.",
    "a powerful platform": "a powerful platform and a rich market make the technology more robust and the application more focused",
    "about": "about",
    "about us": "about us",
    "active monitoring of key business": "active monitoring of key business",
    "active monitoring of key business desc": "initiate uninterrupted timing requests to important business addresses, determine the health of application services, and actively count performance and health information",
    "adress": "adress",
    "application performance manage": "application performance manage",
    "application performance manage desc": "application performance monitoring tools for distributed systems, tailored for cloud-native (Docker, Kubernetes, Mesos) microservices, covering the complete end-to-service link",
    "application topology automatic discovery": "application topology automatic discovery",
    "application topology automatic discovery desc": "automatically draw the global topology architecture diagram according to the microservice calling relationship, which can clearly understand the relationship and calling situation between the microservices",
    "as the scale of the enterprise expands": "As the scale of the enterprise expands, the complexity of IT systems is getting higher and higher. In the process of Internet transformation, Haier has incubated hundreds of multi-format small and micro applications. These applications are often used by different vendors with different technical architectures. Development and operation and maintenance, applications are discrete and separated, and the problems that arise are:",
    "automated CI/CD": "automated CI/CD",
    "automated CI/CD desc": "provides pipeline services for code scanning, construction, testing, and deployment, making continuous integration of applications easier",
    "automatic test": "automatic test",
    "automatic test desc": "support drag-and-drop graphical orchestration of test cases and test scenarios, and provide multi-capable assertion and mock capabilities",
    "automation": "automation",
    "based on kubernetes + cloud": "based on kubernetes + cloud architecture, inherently cloud-native, eco-friendly",
    "based on the pipeline engine": "based on the pipeline engine, the continuous integration process can be flexibly customized; it supports the construction of any language, and the expansion market provides a build pack for popular development languages; it provides energy efficiency analysis such as code analysis and construction analysis.",
    "branch rule manage": "branch rule manage",
    "branch rule manage desc": "following the GitFlow specification, the platform precipitates the contractual relationship between the branch and the environment. at the same time, it supports user-defined branch rule configuration",
    "built-in rich Action and Addon capabilities": "built-in rich Action and Addon capabilities",
    "built-in rich Action and Addon capabilities desc": "the platform has built-in rich assembly line service template capabilities, which can be used directly according to different development languages and other dimensions",
    "business innovation costs are high": "business innovation costs are high and the cycle is long: the lack of a sharable service center, the chimney system built for specific business problems, cannot be effectively opened up, and there is a large number of repeated constructions, resulting in high innovation costs for enterprises.",
    "carry out one-stop microservice": "carry out one-stop microservice life cycle management, provide a complete tenant and environment isolation mechanism; provide a unified management and control interface, aggregate information about components such as business gateways, service registration and discovery, configuration centers, distributed tracking, monitoring and alarms, and provide One-stop service governance.",
    "cloud manage": "cloud manage",
    "cloud manage desc": "provide a unified control plane across different cloud vendors or self-built Kubernetes clusters, make resource management and control more convenient, make business applications more flexible, and avoid cloud vendors lock-in",
    "cloud management platform": "cloud management platform",
    "cloud native": "cloud native",
    "cluster management": "cluster management",
    "code hosting": "code hosting",
    "code repository": "code repository",
    "code repository desc": "based on the Git protocol, the platform defaults to an enterprise-level code warehouse, which is ready to use out of the box, no need to build or purchase",
    "code scanning and unit testing": "code scanning and unit testing",
    "code scanning and unit testing desc": "discover code defects, security vulnerabilities, code irregularities and other issues in time",
    "company address": "2nd Floor, Building 1, Feitian Park, Yunqi Town, Dingshan Road, Zhuantang Street, Xihu District, Hangzhou",
    "comprehensive build type": "comprehensive build type",
    "comprehensive build type desc": "the platform fully supports various development language frameworks such as Java, Go, Node, Python, etc., and supports the construction of software packages such as application Docker images, Jar packages, and mobile application installation packages",
    "contact email": "email",
    "contact us": "contact us",
    "copy": "copy",
    "custom log analysis rules": "custom log analysis rules",
    "custom log analysis rules desc": "custom log analysis rules desc",
    "customizable visualization of the market and alarms": "customizable visualization of the market and alarms",
    "customizable visualization of the market and alarms desc": "provide flexible custom chart alarm configuration to meet the display and alarm requirements of various monitoring operation and maintenance scenarios such as business monitoring, risk warning, performance analysis, etc.",
    "data bank": "data bank",
    "data bank desc": "based on the management of the test data source, the platform can prepare test data in large quantities through sql through the configuration sheet, and the configuration sheet and interface test cases can be seamlessly connected through the graphical orchestration pipeline",
    "data interoperability": "data interoperability: unified data governance system",
    "data lacks unified governance": "data lacks unified governance: applications of different technical architectures cannot be integrated, forming a large number of data islands. Taking member data as an example, users in different channels include offline stores, Weibo, WeChat and other self-media, official website community groups, and Youjia APP , Various industrial APP, shopping malls, micro-shops and other channels interact with Haier. Information is distributed in various interactive portals, which cannot be integrated and applied uniformly. The internal management of the enterprise is complicated and the user experience is poor. ",
    "data task": "data task",
    "data task is a module that supports": "data task is a module that supports data task creation, operation and maintenance in fast data application. Based on the integrated workflow engine and scheduling engine of the Dice platform, the data pipeline can be configured flexibly and quickly, and the operation is simple and efficient.",
    "declarative orchestration of cloud services": "declarative orchestration of cloud services",
    "declarative orchestration of cloud services desc": "based on declarative configuration, it can flexibly orchestrate various middleware cloud services provided by cloud vendors, such as databases, message queues, and object storage. Improve operation and maintenance efficiency and accelerate business migration to the cloud",
    "diagnosis of abnormal and slow transactions": "diagnosis of abnormal and slow transactions",
    "diagnosis of abnormal and slow transactions desc": "comprehensive application performance monitoring, covering time-consuming web interface, time-consuming RPC call, slow database query, cache, etc., to easily track down system slow issues",
    "digital asset operatio desc": "from the perspective of the enterprise, analyze the resource utilization and availability of all digital assets, as well as cloud vendor bills and other data. View hot and idle assets vertically, and compare project costs and resource budgets horizontally",
    "digital asset operation": "digital asset operation",
    "document": "document",
    "documentation": "documentation",
    "ecological compatibility": "ecological compatibility",
    "email": "email",
    "enter the platform": "进入平台",
    "enterprise official website": "enterprise official website",
    "expand the market": "expand the market",
    "expert service": "expert service",
    "extended service": "extended service",
    "external code repository": "external code repository",
    "external code repository desc": "support seamless docking of mainstream code repository in the industry",
    "fast data platform": "fast data platform",
    "flexible scaling": "flexible scaling",
    "focus on your own business applications": "focus on your own business applications, and leave the tedious operation and maintenance work to the platform to complete",
    "free registration": "free registration",
    "free trial": "free trial",
    "from the front-end": "from the front-end or from the browser to the first-level server, container and code, application performance analysis can be performed at each level; application monitoring can automatically collect application-related information and grasp application status in time; decentralized tracking provides end-to-end tracking capabilities, precise positioning of functions and performance issues ; Support real-time correction and full-stack root cause positioning to improve the efficiency of operation, maintenance and development.",
    "full link diagnosis and tracking": "full link diagnosis and tracking",
    "full link diagnosis and tracking desc": "according to the information capture of each request point in the link of each call of the microservice, the full transparency of the call information of the entire link is realized, and the diagnosis and analysis of the application call link are developed efficiently and conveniently",
    "fully automated development process": "fully automated development process, no need for professional operation and maintenance engineers to support",
    "graphical orchestration": "graphical orchestration",
    "graphical orchestration desc": "provides a drag-and-drop graphical editing method to make CI/CD editing easier",
    "haier": "haier",
    "haier Group was founded": "haier Group was founded in 1984 and is a global brand of large home appliances. It has now transformed from a traditional manufacturer of home appliances to a platform for incubating makers for the whole society; Haier Smart Home uses the Internet of Things, artificial intelligence, and big data to open things through U+ Combine platform and scene business to achieve the best smart life experience. ",
    "haier relies on the best": "haier relies on the best practice of enterprise digital platform (Dice) to realize digital transformation",
    "header devOps desc": "Application-centric DevOps to create the ultimate enterprise-level application development experience",
    "header fdp desc": "fast data management based on streaming computing, providing a real-time unified data management platform",
    "header ms desc": "microservice governance without code intrusion to ensure the safety and stable production of enterprise applications",
    "header multi-cloud desc": "cloud vendors unbound multi-cloud management to build an efficient enterprise hybrid cloud architecture",
    "high scalability": "high scalability",
    "infrastructure interoperability": "infrastructure interoperability: a unified infrastructure management system",
    "intelligent operation and maintenance": "intelligent operation and maintenance",
    "it is fully compatible with mainstream open": "it is fully compatible with mainstream open source products such as Spring Cloud, Dubbo, Istio, Kubernetes, etc., to ensure smooth application migration, and supports in-depth customization of mainstream functions to meet enterprise-level high-performance and high-reliability requirements.",
    "join us": "join us",
    "library": "library",
    "links": "links:",
    "log analysis management": "log analysis management",
    "log analysis management desc": "log analysis is a service for searching and analyzing application logs, helping users to dig deeper into the business value of log data",
    "log data visualization and alerting": "log data visualization and alerting",
    "log data visualization and alerting desc": "for log analysis results, provide flexible custom chart alarm configuration to meet the display and alarm requirements of various monitoring operation and maintenance scenarios such as business monitoring, risk warning, performance analysis, etc",
    "log in": "log in",
    "make full use of the security": "make full use of the security architecture of the public cloud platform to strengthen and protect the platform in an all-round way",
    "market": "market",
    "microservice": "microservice",
    "microservice governance": "microservice governance",
    "mobile application": "mobile application",
    "more": "more",
    "multi-cloud architecture": "multi-cloud architecture",
    "no content yet": "no content yet",
    "no deployment, no operation and maintenance": "no deployment, no operation and maintenance",
    "node resources can easily": "node resources can easily be dynamically expanded and contracted, and various business promotion activities can be easily dealt with",
    "ok": "ok",
    "one-stop platform": "one-stop platform",
    "operation and maintenance service": "operation and maintenance service",
    "overview": "overview",
    "partners": "partners",
    "pipeline": "pipeline",
    "pipeline task": "pipeline task",
    "popular searches": "popular searches",
    "powerful service": "powerful service and task expansion capabilities. Extended services include basic middleware and microservices. Enterprises can register continuous integration projects as microservices to extend them for use by other projects and achieve the goal of self-built business centers; task extensions are used for execution pipelines, which can be used by enterprises or on their own Expansion of research and development tasks to expand pipeline capabilities.",
    "price": "price",
    "product": "product",
    "provide high-performance git": "provide high-performance git code hosting services and easy-to-use visual editing services. It is highly integrated on the Dice platform and seamlessly connects to the CI/CD process. ",
    "provide one-stop service for log data": "provide one-stop service for log data",
    "provide one-stop service for log data desc": "provide log data collection, consumption, delivery, query analysis and other functions, perform structured tag retrieval of logs, and automatically associate logs and call links to realize log diagnosis and analysis of the entire link",
    "refined authority manage": "refined authority manage",
    "refined authority manage desc": "according to the different latitudes of the project, the user role of the application, the branch, etc., the access and editing permissions of the code branch are subdivided",
    "resource": "resource",
    "rich release management": "rich release management",
    "rich release management desc": "support according to the needs of the release level, add the designated approver in the pipeline to approve and approve before deployment, or through the enterprise-level network closure to uniformly control the enterprise deployment approval management",
    "safety": "safety",
    "scan and follow WeChat public account": "scan and follow WeChat public account",
    "serious waste of basic resources": "serious waste of basic resources: Distributed deployment and operation and maintenance cannot maximize the allocation and scheduling of resources, resulting in low enterprise efficiency. At the same time, distributed operation and maintenance leads to uneven system operation and maintenance levels and many hidden dangers. ",
    "service governance": "service governance",
    "service interoperability": "service interoperability: unified software technology system",
    "service market": "service market",
    "sign out": "sign out",
    "stay tuned": "stay tuned",
    "success": "success",
    "success case": "success case",
    "support elastic expansion": "support elastic expansion, easily realize horizontal and initial expansion of business and dependent services. Facilitate rapid development and continuous innovation, and reduce development and operation and maintenance costs.",
    "supports multi-cloud management": "supports multi-cloud management and control, shields multi-cloud heterogeneity; provides a correct interference interface, including operation and maintenance perspectives, analysis reports, machine management, service catalogs, etc.; pool management of resources, on-demand use, to avoid waste; support for multiple enterprises The form of tenants is feasible and can be rented to other enterprises to use, and to ensure the isolation of resources between enterprises.",
    "telephone": "telephone",
    "test cases and bug manage": "test cases and bug manage",
    "test cases and bug manage desc": "support manual use cases, interface use cases, use case planning, test reports, and full testing process management of defects",
    "test manage": "test manage",
    "test manage desc": "provide a full range of test manage capabilities including code unit testing, code security testing, manual test case management and automatic testing",
    "the Dice platform implements a unified": "the Dice platform implements a unified technical architecture (microservices), unified scheduling of multi-cloud resources and unified data governance, and solves the problems of unified R&D, unified deployment, and operation and maintenance of enterprises in a multi-cloud environment.",
    "the platform has complete functions": "the platform has complete functions, from development to operation and maintenance, from business to data to achieve comprehensive coverage",
    "through the enterprise": "through the enterprise digital platform (Dice), we provide a container-based multi-cloud management system, a service research and development system with a microservice architecture as the core, and a data governance system based on fast data. The implementation of the interconnection platform is completed in three stages:",
    "to create an interconnection platform ": "to create an interconnection platform ",
    "training and support": "training and support",
    "unbind business applications": "unbind business applications from cloud vendors, easily realize business migration between multiple clouds, without worrying about being locked up by a single cloud vendor",
    "weChat public account": "weChat public account",
    "what difficulties does your team have in the application development process?": "what difficulties does your team have in the application development process?",
    "white screen operation and maintenance Kubernetes": "white screen operation and maintenance Kubernetes",
    "white screen operation and maintenance Kubernetes desc": "on the web interface of multi-cloud management, all Kubernetes operation and maintenance operations can be completed without logging in to the machine. Based on TLS encryption, ACL control, and log auditing, all operation and maintenance operations are safe and traceable",
    "why choose erda cloud?": "why choose erda cloud?"
  }
}
